Revit 2024 API
FBXExportOptions Members
The FBXExportOptions type exposes the following members.
Constructors
Name | Description
FBXExportOptions
Default constructor. Sets all options to their default values.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
LevelsOfDetailValue
The value of the levels of detail.
StopOnError
Whether export process should stop when a view fails to export.
UseLevelsOfDetail
True to use levels of detail, false otherwise.
WithoutBoundaryEdges
True to export without boundary edges, false otherwise.
See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace